Tekla Open API Reference for Tekla Structures 2025
DetailMarkAttributes Properties
The DetailMark.DetailMarkAttributes type exposes the following members.
Properties
Name | Description
BoundaryLineColor |  Obsolete.
BoundaryLineType |  Obsolete.
BoundaryShape
 The detail mark boundary shape.
BoundingLine
 Gets or sets the line type.
MarkName
 The detail mark name.
MarkSymbolAttributes
 The detail mark symbol attributes.
MarkSymbolColor
TagsAttributes
 The attributes for detail mark tags.
TrueMarkSymbolColor
 The true color (rgb enabled) of the detail mark symbol.
Top
See Also
Reference
DetailMark.DetailMarkAttributes Class
Tekla.Structures.Drawing Namespace